#include "ConsoleIn.h"
#include "wind.h"

#include "WinPrintC.h"


CDbgWind s_tUpHd = {0};

/**********************************************************************
* 函数: UP_Init
* 功能: WinPrint模块初始化
* 参数: vId--控制台ID。仅预留，暂不支持。建议传入0值
*		vSize--日志缓存大小。有待支持。建议传入0值。
* 返回: 0值--成功
*		非0--错误类型
* 说明:
***********************************************************************
* 日期			作者		动作
***********************************************************************
* 2022-05-09	CCQ		创建
**********************************************************************/
int UP_Init(void)
{
    s_tUpHd = Wind_Init();
    Console_Init(&s_tUpHd);

    UP_Printf(1, "console");

    return 0;
}


