#include "printd.h"
#include "dispd.h"
#include "Tickd.h"

#include "DispPrint.h"


CDbgDispd s_tUpHd = {0};

/**********************************************************************
* 函数: UP_Init
* 功能: DispPrint模块初始化
* 参数: vId--显示屏ID。仅预留，暂不支持。建议传入0值
*		vSize--日志缓存大小。有待支持。建议传入0值。
* 返回: 0值--成功
*		非0--错误类型
* 说明: 
***********************************************************************
* 日期			作者		动作
***********************************************************************
* 2022-05-09	CCQ		创建
**********************************************************************/
int UP_Init(void)
{
    s_tUpHd = Dispd_Init();
    // 默认支持tick功能
    Tickd_Init(&s_tUpHd);

    UP_Printf(1, "dispd");
    
    return 0;
}


