#include "ConsoleIn.h"

#include "CslCmd.h"

// console输入输出模块的句柄
void *s_ptCslHd = NULL;

/**********************************************************************
* 函数: Console_Init
* 功能: 控制台初始化
* 参数: ptHd--IO句柄
* 返回: 0值--成功
*		非0--错误类型
* 说明:
***********************************************************************
* 日期			作者		动作
***********************************************************************
* 2022-05-14	CCQ		创建
**********************************************************************/
int Console_Init(void *ptHd)
{
    s_ptCslHd = ptHd;

	// 指令模块初始化
	CslCmd_Init();
	// 菜单模块初始化


    return 0;
}

